[
  {
    "rantText": "New manager pushed my buttons really bad, normally I can handle him while being nice, but I was helping another manager with some safety stuff. This manager was on my case until I burst out crying and had to leave.",
    "rantAuthor": "ihatechipotle",
    "company": "Chipotle"
  },
  {
    "rantText": "I tried switching my role, but because of my proclaimed 'lack of experience' and me having too much initiative (which is apparently a turn-off for them), it is their justification that I am not enough.",
    "rantAuthor": "baka",
    "company" : "Coffee Bean"
  },
  {
    "rantText": "So TIL that there are four people at my job that hold the same position as I do with the same certifications and same title, all with less experience, that make $3-$5 more an hour than I do.",
    "rantAuthor": "Why The Lucky Stiff",
    "company" : "McDonalds"
  },
  {
    "rantText": "When I first started, the next newest person had been there almost 2 years. We now have an average turnover rate of a couple months.",
    "rantAuthor": "daisydukes",
    "company" : "Lush"
  },
  {
    "rantText": "I was called into a 2 hour meeting with the boss and assistant boss a few days ago to let me know they were completely changing up my job description, again, for the second time in as many months.",
    "rantAuthor": "susurus",
    "company" : "Forever21"
  },
  {
    "rantText": "I think my supervisor has given up because they had never really tried to engage with me since I have been their employee.",
    "rantAuthor": "fuddyduddy",
    "company": "Ulta"
  },
  {
    "rantText": "I am not working off the clock, i refuse!!! I only do 'things' for work when I am being paid!!!",
    "rantAuthor": "wagecuck",
    "company": "Sushi Enya"
  },
  {
    "rantText": "I want a different job for mental health's sake, but I live in a rural area and theres not that many of the jobs in my field around here.",
    "rantAuthor": "stressin",
    "company": "Sprint"
  },
  {
    "rantText": "Every project, every task feels pulled out of no where and I get the brunt of it.",
    "rantAuthor": "companysux",
    "company": "Mejuri"
  },
  {
    "rantText": "I just think it's so messed up when they see you are struggling with mental health because there are so severe issues in your life, but they still tell you they are not getting the energy they wanted from you.",
    "rantAuthor": "Lernantino",
    "company": "Little Caesar"
  }
]
